In [26]:
# ----------- I got this table from a PDF with data from 'Japan Tourism Statistics' website and used Tabula extention
# ------to get the CSV I will insert now to clean and merge with data from other CSV.------------------------------

import pandas as pd
df = pd.read_csv('C:/Users/paula/csv_to_edit.csv')

In [27]:
display(df)

   Unnamed: 0 Visitor Arrivals\r20192021 Growth Rate(%)\r20192021
0        Jan.          2,689,33946,522 *                  -98.3 *
1        Feb.           2,604,3227,355 *                  -99.7 *
2        Mar.          2,760,13612,276 *                  -99.6 *
3        Apr.          2,926,68510,853 *                  -99.6 *
4         May          2,773,09110,035 *                  -99.6 *
5        Jun.           2,880,0419,251 *                  -99.7 *
6        Jul.          2,991,18951,055 *                  -98.3 *
7        Aug.          2,520,13425,916 *                  -99.0 *
8        Sep.          2,272,88317,720 *                  -99.2 *
9        Oct.         2,496,56822,100 **                 -99.1 **
10       Nov.         2,441,27420,700 **                 -99.2 **
11       Dec.                  2,526,387                      NaN

In [28]:
#Separating the yearly values into 2 different columns
df['column'] = df['Visitor Arrivals\r20192021'].astype(str)
df['Arrivals 2019'] = df['column'].str[0:9]
df['Arrivals 2021'] = df['column'].str[9:15]
df['Arrivals 2021']

0     46,522
1     7,355
2     12,276
3     10,853
4     10,035
5     9,251
6     51,055
7     25,916
8     17,720
9     22,100
10    20,700
11
Name: Arrivals 2021, dtype: object

In [29]:
#Creating a column for month dates
from datetime import datetime
date=['{0:02d}-01'.format(i) for i in range(1, 13)]
print(date)

['01-01', '02-01', '03-01', '04-01', '05-01', '06-01', '07-01', '08-01', '09-01', '10-01', '11-01', '12-01']

In [30]:
df['column1'] = df['Growth Rate(%)\r20192021'].astype(str)
df['Growth Rate'] =  df['column1'].str[0:5]
display(df['Growth Rate'])

0     -98.3
1     -99.7
2     -99.6
3     -99.6
4     -99.6
5     -99.7
6     -98.3
7     -99.0
8     -99.2
9     -99.1
10    -99.2
11      nan
Name: Growth Rate, dtype: object

In [31]:
df['date'] = pd.Series(date)
print (df['date'])

0     01-01
1     02-01
2     03-01
3     04-01
4     05-01
5     06-01
6     07-01
7     08-01
8     09-01
9     10-01
10    11-01
11    12-01
Name: date, dtype: object

In [32]:
#Putting the extracted table together
result=pd.concat([df['date'], df['Arrivals 2019'],df['Arrivals 2021'],df['Growth Rate']], axis=1, join="inner")
display(result)

     date Arrivals 2019 Arrivals 2021 Growth Rate
0   01-01     2,689,339        46,522       -98.3
1   02-01     2,604,322        7,355        -99.7
2   03-01     2,760,136        12,276       -99.6
3   04-01     2,926,685        10,853       -99.6
4   05-01     2,773,091        10,035       -99.6
5   06-01     2,880,041        9,251        -99.7
6   07-01     2,991,189        51,055       -98.3
7   08-01     2,520,134        25,916       -99.0
8   09-01     2,272,883        17,720       -99.2
9   10-01     2,496,568        22,100       -99.1
10  11-01     2,441,274        20,700       -99.2
11  12-01     2,526,387                       nan

In [33]:
#Getting rid of the 2019 values since I only need the ones from 2021
df_2=result['Arrivals 2021']
display(df_2)

0     46,522
1     7,355
2     12,276
3     10,853
4     10,035
5     9,251
6     51,055
7     25,916
8     17,720
9     22,100
10    20,700
11
Name: Arrivals 2021, dtype: object

In [34]:
print(type(df_2))

<class 'pandas.core.series.Series'>

In [35]:
value=df_2.tolist()
print(value)

['46,522', '7,355 ', '12,276', '10,853', '10,035', '9,251 ', '51,055', '25,916', '17,720', '22,100', '20,700', '']

In [36]:
year=[2021]*12
print(year)

[2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021]

In [44]:
import pandas as pd
dff=pd.DataFrame([year,date,value]).T
heads=['year','date','value']
dff.columns=heads
display(dff)

    year   date   value
0   2021  01-01  46,522
1   2021  02-01  7,355
2   2021  03-01  12,276
3   2021  04-01  10,853
4   2021  05-01  10,035
5   2021  06-01  9,251
6   2021  07-01  51,055
7   2021  08-01  25,916
8   2021  09-01  17,720
9   2021  10-01  22,100
10  2021  11-01  20,700
11  2021  12-01

In [58]:
#Removing commas
dff['value']=dff['value'].str.replace(',','')
display(dff)

    year   date  value
0   2021  01-01  46522
1   2021  02-01  7355
2   2021  03-01  12276
3   2021  04-01  10853
4   2021  05-01  10035
5   2021  06-01  9251
6   2021  07-01  51055
7   2021  08-01  25916
8   2021  09-01  17720
9   2021  10-01  22100
10  2021  11-01  20700
11  2021  12-01

In [59]:
#Bringing the inbound tourists for 2020 table and merge with 2021 numbers
df0 = pd.read_csv('C:/Users/paula/japan_inbound_2020.csv')
display(df0)

    Unnamed: 0  year   date    value
0            0  2019  01-01  2689339
1            1  2019  02-01  2604322
2            2  2019  03-01  2760136
3            3  2019  04-01  2926685
4            4  2019  05-01  2773091
5            5  2019  06-01  2880041
6            6  2019  07-01  2991189
7            7  2019  08-01  2520134
8            8  2019  09-01  2272883
9            9  2019  10-01  2496568
10          10  2019  11-01  2441274
11          11  2019  12-01  2526387
12          12  2020  01-01  2661022
13          13  2020  02-01  1085147
14          14  2020  03-01   193658
15          15  2020  04-01     2917
16          16  2020  05-01     1663
17          17  2020  06-01     2565
18          18  2020  07-01     3782
19          19  2020  08-01     8658
20          20  2020  09-01    13684
21          21  2020  10-01    27386
22          22  2020  11-01    56673
23          23  2020  12-01    58673

In [60]:
df00=df0.loc[df0['year']==2020]
display(df00)

    Unnamed: 0  year   date    value
12          12  2020  01-01  2661022
13          13  2020  02-01  1085147
14          14  2020  03-01   193658
15          15  2020  04-01     2917
16          16  2020  05-01     1663
17          17  2020  06-01     2565
18          18  2020  07-01     3782
19          19  2020  08-01     8658
20          20  2020  09-01    13684
21          21  2020  10-01    27386
22          22  2020  11-01    56673
23          23  2020  12-01    58673

In [61]:
df_final=pd.concat([df00,dff],ignore_index=True)
display(df_final)

    Unnamed: 0  year   date    value
0         12.0  2020  01-01  2661022
1         13.0  2020  02-01  1085147
2         14.0  2020  03-01   193658
3         15.0  2020  04-01     2917
4         16.0  2020  05-01     1663
5         17.0  2020  06-01     2565
6         18.0  2020  07-01     3782
7         19.0  2020  08-01     8658
8         20.0  2020  09-01    13684
9         21.0  2020  10-01    27386
10        22.0  2020  11-01    56673
11        23.0  2020  12-01    58673
12         NaN  2021  01-01    46522
13         NaN  2021  02-01    7355
14         NaN  2021  03-01    12276
15         NaN  2021  04-01    10853
16         NaN  2021  05-01    10035
17         NaN  2021  06-01    9251
18         NaN  2021  07-01    51055
19         NaN  2021  08-01    25916
20         NaN  2021  09-01    17720
21         NaN  2021  10-01    22100
22         NaN  2021  11-01    20700
23         NaN  2021  12-01

In [67]:
df_final.to_csv('C:/Users/paula/japan_inbound_2021.csv', encoding='utf-8')